blog_on_rails_part1/app/controllers/comments_controller.rb

    def create
        @comment =Comment.new comment_params
        @comment.post=@post
        @comment.save
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "fengjbwhj"], ["post_id", 99], ["created_at", "2021-02-03 02:41:21.909649"], ["updated_at", "2021-02-03 02:41:21.909649"]]

    def destroy
        @comment = Comment.find params[:id]
        @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 596], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 596]]

    def find_post
        @post = @post = Post.find_by_id params[:post_id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]