blog_on_rails_part1/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new post"], ["body", "megnewjbgwhjebg ewjemgnjebg jerhbg wjehgb wjeb fkewkngjkwnejgwebgjhb"], ["created_at", "2021-02-03 02:41:01.708211"], ["updated_at", "2021-02-03 02:41:01.708211"]]
---
    def create
        @post = Post.new post_params

        if @post.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 102]]
---
    def show
        @comments = @post.comments.order(created_at: :DESC)

UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Aperiam perferendis consequuntur.edit"], ["body", "sjvgebwjhbgwwjkgbqwhjwgbjqkjwgblewjbguewhjbkewhjbilewj"], ["updated_at", "2021-02-03 02:41:17.951618"], ["id", 99]]
---
    def update
            if @post.update post_params

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
---
    def find_post
        @post = Post.find_by_id params[:id]